Repository: JAK0TA/formhandler
Catalog: Resources/Private/Language/*.locallang_tca.xlf
Languages: de

# formhandler.pi_flexform.sheet_general
source: General Settings
de: Allgemeine Einstellungen

# formhandler.pi_flexform.sheet_emailAdminSettings
source: Admin E-Mail Settings
de: Admin E-Mail Einstellungen

# formhandler.pi_flexform.sheet_emailUserSettings
source: User E-Mail Settings
de: User E-Mail Einstellungen

# formhandler.pi_flexform.sheet_miscSettings
source: Other Settings
de: Andere Einstellungen

# formhandler.pi_flexform.template_file
source: Template File
de: Template-Datei

# formhandler.pi_flexform.emailRecipient
source: Recipient
de: Empfänger

# formhandler.pi_flexform.emailSubject
source: Subject
de: Betreff

# formhandler.pi_flexform.emailFrom
source: Mail From E-mail
de: Absender E-mail

# formhandler.pi_flexform.emailFromName
source: Mail From Name
de: Absendername

# formhandler.pi_flexform.redirectPage
source: Redirect Page
de: Redirect Seite

# formhandler.pi_flexform.mandatoryFields
source: Mandatory fields (enter names of formular fields seperated by ",")
de: Pflichtfelder (Kommaseparierte Liste mit Formularfeldnamen)

# formhandler.pi_flexform.replyTo
source: Reply-To E-mail (optional, name of input field)
de: Reply-To E-mail

# formhandler.pi_flexform.replyToName
source: Reply-To Name (optional, name of input field)
de: Reply-To Name

# formhandler.pi_flexform.cc
source: Send CC E-mail to (optional, name of input field)
de: Sende CC E-mail an

# formhandler.pi_flexform.bcc
source: Send BCC E-mail to (optional, name of input field)
de: Sende BCC E-mail an

# formhandler.pi_flexform.emailConfirm
source: Send E-mail to address entered in form (enter name of form field here)
de: Sende E-mail an eine Adresse, die im Formular eingegeben wurde (Name des Formularfelds eingeben)

# formhandler.pi_flexform.emailConfirmSubject
source: Subject of the mail to the user:
de: Betreff dieser E-Mail

# formhandler.pi_flexform.template_predefined
source: Predefined forms:
de: Vordefinierte Formulare

# formhandler.pi_flexform.lang_file
source: Translation File
de: Übersetzungsdatei
