Repository: JAK0TA/formhandler
Catalog: Resources/Private/Language/*.locallang_debug.xlf
Languages: de

source: Adding HTML:
de: Füge HTML hinzu:

source: Adding generated files:
de: Füge generierte Dateien hinzu:

# alert_mail_not_sent
source: Mails not sent because a mail has already been sent in defined interval!
de: E-Mails nicht verschickt, da eine Benachrichtigungs-E-Mail für dieses Intervall schon verschickt wurde!

# attachment_not_found
source: Attachment not found: %s!
de: Attachment nicht gefunden: %s!

# calling_class
source: Calling class "%s"
de: Rufe Klasse "%s" auf!

# calling_finisher
source: Calling finisher "%s"
de: Rufe Finisher "%s" auf!

# calling_logger
source: Calling logger "%s"
de: Rufe Logger "%s" auf!

# calling_validator
source: Calling validator "%s"
de: Rufe Validator "%s" auf!

# check_not_found
source: Error check "%s" not found!
de: Error check "%s" nicht gefunden!

# check_skipped
source: Skipped error check "%s"!
de: Error check "%s" übersprungen!

# cleaning_temp_files
source: Cleaning temporary files in folder "%s"!
de: Lösche temporäre Dateien in "%s"!

# cleared_session
source: Cleared params in session
de: Leere Parameter in der Session

# condition
source: Condition was evaluated as %s : %s!
de: Bedingung wurde ausgewertet als %s : %s!

# copy_file
source: Copying file "%s" to "%s"!
de: Kopiere Datei "%s" nach "%s"!

# current_files
source: The current uploaded files are:
de: Aktuell hochgeladene Dateien:

# current_gp
source: The current GET/POST params are:
de: Die aktuellen GET/POST-Parameter:

# current_session_params
source: The current values in session are:
de: Die aktuellen Werte in der Session:

# current_step
source: Current step is: %s
de: Aktueller Step: %s

# data_stored
source: Data gets stored!
de: Daten werden gespeichert!

# deleting_file
source: Deleting file "%s"!
de: Lösche Datei "%s"!

# error
source: The following error occurred: %s
de: Ein Fehler ist aufgetreten: %s

# folder_doesnt_exist
source: Folder "%s" doesn't exist! Trying to create!
de: Verzeichnis "%s" existiert nicht! Formhandler versucht es anzulegen!

# form_finished
source: Form is finished!
de: Formular ist beendet!

# init_values
source: Initial values
de: Initiale Werte

# invalid_isset
source: "Invalid format of ISSET Marker. Hint: %s
de: Ungültiges Format für ISSET Marker. Tipp: %s

# logging
source: Logging into table "%s" values: %s!
de: Logge in Tabelle "%s" folgende Werte: %s!

# mail_disabled
source: Skipped %s mail because it is disabled in TypoScript!
de: Überspringe %s E-Mail, weil abgeschalten in TypoScript!

# mail_html
source: Message HTML:
de: Nachricht HTML:

# mail_message
source: Message:
de: Nachricht:

# mail_not_sent
source: Mail NOT sent to: %s
de: E-Mail NICHT verschickt an: %s

# mail_plain
source: Message plain:
de: Nachricht plain:

# mail_sender
source: Sender:
de: Absender:

# mail_sent
source: Mail successfully sent to: %s
de: E-Mail verschickt an: %s

# mail_subject
source: Subject: %s
de: Betreff: %s

# missing_field_for_error_check
source: Trying to validate a field that doesn't exist: "%s"! Either you forgot to remove an error check or yorgot to add a field to your HTML! Maybe it is just an unset checkbox field! In that case, everything is fine.
de: Validierung eines nicht existenten Feldes: "%s"! Vielleicht haben Sie vergessen einen Error Check zu entfernen oder ein Feld zum HTML hinzuzufügen. Vielleicht ist das Feld aber auch nur eine Checkbox. In diesem Fall ist alles OK.

# no_submittedok_template
source: SubmittedOK template not found! Make sure that the subpart ###TEMPLATE_SUBMITTEDOK### is in your HTML template!
de: SubmittedOK-Template nicht gefunden! Stellen Sie sicher, dass der Subpart ###TEMPLATE_SUBMITTEDOK### im HTML-Template ist!

# no_error_message
source: Could not find error message with key "%s"!
de: Konnte Fehlermeldung mit Key "%s" nicht finden!

# no_mail_template
source: E-Mail template not found for mode %s and type %s! This mail is skipped!
de: E-Mail-Template für Modus %s und Typ %s nicht gefunden! Diese E-Mail wird übersprungen!

# no_update_possible
source: UID parameter not found in GP. Cannot make update!
de: UID-Parameter nicht gefunden in GP. Update nicht möglich!

# redirect_failed
source: Tried to do a redirect to specified page! The redirect may have failed because the debug settings is on!
de: Versuchte eine Weiterleitung zur angegebenen Seite zu machen! Die Weiterleitung ist gescheitert, möglicherweise weil der Debug-Modus aktiviert ist!

# sql_request
source: Executing request "%s";
de: Führe aus: "%s"

# sql_request_error
source: SQL request failed: %s
de: SQL Ausführung fehlgeschlagen: %s

# sql_too_many_rows
source: SQL request resulted in %d rows! Only one row is allowed.
de: SQL-Abfrage lieferte %s Ergebnisse. Nur ein Ergebnis ist erlaubt.

# store_gp
source: Storing GP in session!
de: Speichere GP in Session!

# subparts_missing
source: Subparts in template missing! Found: %s
de: Subparts fehlen im Template! Gefunden: %s

# total_steps
source: Highest step subpart found in template file (number of steps): %s
de: Höchster Subparts im Template (Anzahl der Steps): %s

# using_controller
source: Using controller "%s"
de: Verwende Controller "%s"

# using_prefix
source: Using prefix for form values: "%s"
de: Verwende Prefix für Formularwerte: "%s"

# using_subpart
source: Using subpart "%s"!
de: Verwende Subpart "%s"!

# using_view
source: Using view "%s"
de: Verwende View "%s"

# cacheCmd
source: Clearing cache user cacheCmd "%s"
de: Cache wird gelöscht mit cacheCmd "%s"
