Repository: JAK0TA/formhandler
Catalog: Resources/Private/Language/*.locallang_exceptions.xlf
Languages: de

# fe-exception
source: An error has occurred!
de: Ein Fehler ist aufgetreten!

# extension_required
source: The extension "%s" is required for %s!
de: Die Extension "%s" wird benötigt für %s!

# missing_config
source: No TypoScript config found for Formhandler! Please add the static template or write your own configuration.
de: Keine TypoScript-Konfiguration für Formhandler gefunden! Fügen Sie das statische Template oder Ihre eigene Konfiguration ein.

# insufficient_config
source: Insufficient config for %s!
de: Unzureichende Konfiguration für %s!

# error_getmxrr
source: The PHP version you are using is too low. The error check "emailExists" is not available on your system. Please remove it from your TypoScript configuration.
de: Ihre PHP version ist zu niedrig, um den Error-Check "emailExists" verwenden zu können. Bitte entfernen Sie den Error-Check aus Ihrer TypoScript-Konfiguration.

# missing_component
source: Missing %s! The Flexform contains '%s' but typoscript configuration is incomplete. Please add : %s
de: %s fehlt! Flexform beinhaltet '%s',aber die TypoScript-Konfiguration ist unvollständig. Bitte fügen Sie '%s' hinzu!

# no_config_confirmation
source: Missing config for %s! Please provide a '%s' either in the TypoScript configuration or in the Flexfom.
de: Fehlende Konfiguration für %s! Bitte geben Sie '%s' entweder in der TypoScript-Konfiguration oderr im Flexfom ein.

# no_pdf_template
source: No template for PDF found! Make sure subpart ###TEMPLATE_PDF### exists in your HTML template file!
de: Kein Template für PDF gefunden! Bitte prüfen Sie ob der Subpart ###TEMPLATE_PDF### im HTML-Template existiert!

# no_table
source: No table configured for %s!
de: Keine Tabelle konfiguriert für %s!

# no_driver
source: No driver configured for %s!
de: Kein Treiber konfiguriert für %s!

# no_fields
source: No fields mapping configured for %s! Make sure the block "fields" is defined in TyposScript for this component!
de: Kein Mapping konfiguriert für %s! Fügen Sie im TypoScript "fields" für diese Komponente hinzu

# no_template
source: No template file found!
de: Keine Templatedatei gefunden!

# no_template_file
source: No template file found. Check your TypoScript setup and/or your plugin settings and make sure you defined a template file!
de: Keine Template-Datei gefunden. Überprüfen Sie die TypoScript-Konfiguration und/oder die Plugineinstellungen und vergewissern Sie sich, dass Sie eine Template-Datei angegeben haben!

# template_file_not_found
source: Template file "%s" not found!
de: Template-Datei "%s" nicht gefunden!

# empty_template_file
source: Template file "%s" is empty!
de: Template-Datei "%s" ist leer!

# invalid_template_file
source: Template file "%s" does not contain a subpart ###TEMPLATE_ and therefore is not a valid template!
de: Template-Datei "%s" beinhaltet keinen Subpart ###TEMPLATE_ und ist daher keine valide Template-Datei!

# classesarray_error
source: There is an error in your TypoScript setup! Make sure your setup for initInterceptors, finishers, validators, ... looks like this:<br /> <br /><pre> finishers { 1 { class = Finisher_Mail config { } } 2 { class = Finisher_Xyz config { } } } </pre>
de: Fehler im TypoScript Setup! Stellen Sie sicher, dass Ihr Setup für initInterceptors, finishers, validators, ... diesem Schema entspricht:<br /> <br /><pre> finishers { 1 { class = Finisher_Mail config { } } 2 { class = Finisher_Xyz config { } } } </pre>

# spam_detected
source: Your request seems to be a spamming attempt, so it was blocked! This may have been a mistake by the system. Please try again!
de: Ihre Anfrage wurde als Spamversuch erkannt und deshalb geblockt! Falls dies ein Fehler des Systems war, versuchen Sie es bitte erneut!

# validateauthcode_invalid_auth_code
source: The auth code is invalid!
de: Der Autorisierungscode ist ungültig!

# validateauthcode_insufficient_params
source: Insufficient parameters! Unable to validate the auth code!
de: Unzureichende Parameter! Die Autorisierung konnte nicht durchgeführt werden

# validateauthcode_no_record_found
source: No matching auth code found!
de: Der Autorisierungscode wurde nicht gefunden! Vielleicht wurde die Autorisierung bereits durchgeführt.

# validateauthcode_update_failed
source: Updating your data failed! Please try again.
de: Die Aktualisierung Ihrer Daten ist fehlgeschlagen! Bitte versuchen Sie es erneut.

# error_checks_missing
source: Error check missing! Your setup misses error check "%s" for the field "%s"!
de: Error-Check fehlt! Bitte konfigurieren Sie den Error-Check "%s" für das Feld "%s"!

# error_checks_form_field_name_missing
source: Form field name missing for error check "%s"!
de: Name des Formularfelds fehlt für den Error-Check "%s"!

# error_checks_parameters_missing
source: No parameters found for error check "%s" although "%s" is mandatory!
de: Keine Parameter gefunden für Error-Check "%s", "%s" wird benötigt!

# error_checks_unsufficient_parameters
source: Parameter "%s" for error check "%s" not found although it is mandatory!
de: Parameter "%s" nicht gefunden für Error-Check "%s"!

# error_check_filemaxsize
source: The configured "maxSize" (%s) for the field "%s" is bigger than the allowed max upload size configured in php.ini (%s). For more information see: <a target="_blank" href="http://www.php.net/manual/en/ini.core.php#ini.upload-max-filesize">http://www.php.net/manual/en/ini.core.php#ini.upload-max-filesize</a>!
de: Die konfigurierte "maxSize" (%s) für das Feld "%s" ist größer das die max upload size in der php.ini (%s). Mehr Informationen: <a target="_blank" href="http://www.php.net/manual/de/ini.core.php#ini.upload-max-filesize">http://www.php.net/manual/de/ini.core.php#ini.upload-max-filesize</a>!

# db_connection_failed
source: Database connection failed: %s
de: Datenbank-Verbindung fehlgeschlagen: %s
